Microchip-MPLAB-Harmony/touch_apps/apps/t10_mutualcap_xpro_board/pic32cm_pl10_cnano/firmware/src/packs/PIC32CM6408PL10048_DFP/component/ac.h
/* -------- AC_INTFLAGSET : (AC Offset: 0x30) (R/W 32) Interrupt Flag Set -------- */
#define AC_INTFLAGSET_RESETVALUE              _UINT32_(0x00)                                       /*  (AC_INTFLAGSET) Interrupt Flag Set  Reset Value */

#define AC_INTFLAGSET_COMP0_Pos               _UINT32_(0)                                          /* (AC_INTFLAGSET) Comparator 0 Interrupt Flag Position */
#define AC_INTFLAGSET_COMP0_Msk               (_UINT32_(0x1) << AC_INTFLAGSET_COMP0_Pos)           /* (AC_INTFLAGSET) Comparator 0 Interrupt Flag Mask */
#define AC_INTFLAGSET_COMP0(value)            (AC_INTFLAGSET_COMP0_Msk & (_UINT32_(value) << AC_INTFLAGSET_COMP0_Pos)) /* Assignment of value for COMP0 in the AC_INTFLAGSET register */
#define AC_INTFLAGSET_COMP1_Pos               _UINT32_(1)                                          /* (AC_INTFLAGSET) Comparator 1 Interrupt Flag Position */
#define AC_INTFLAGSET_COMP1_Msk               (_UINT32_(0x1) << AC_INTFLAGSET_COMP1_Pos)           /* (AC_INTFLAGSET) Comparator 1 Interrupt Flag Mask */
#define AC_INTFLAGSET_COMP1(value)            (AC_INTFLAGSET_COMP1_Msk & (_UINT32_(value) << AC_INTFLAGSET_COMP1_Pos)) /* Assignment of value for COMP1 in the AC_INTFLAGSET register */
#define AC_INTFLAGSET_WIN0_Pos                _UINT32_(4)                                          /* (AC_INTFLAGSET) Window 0 Interrupt Flag Position */
#define AC_INTFLAGSET_WIN0_Msk                (_UINT32_(0x1) << AC_INTFLAGSET_WIN0_Pos)            /* (AC_INTFLAGSET) Window 0 Interrupt Flag Mask */
#define AC_INTFLAGSET_WIN0(value)             (AC_INTFLAGSET_WIN0_Msk & (_UINT32_(value) << AC_INTFLAGSET_WIN0_Pos)) /* Assignment of value for WIN0 in the AC_INTFLAGSET register */
#define AC_INTFLAGSET_Msk                     _UINT32_(0x00000013)                                 /* (AC_INTFLAGSET) Register Mask  */

#define AC_INTFLAGSET_COMP_Pos                _UINT32_(0)                                          /* (AC_INTFLAGSET Position) Comparator x Interrupt Flag */
#define AC_INTFLAGSET_COMP_Msk                (_UINT32_(0x3) << AC_INTFLAGSET_COMP_Pos)            /* (AC_INTFLAGSET Mask) COMP */
#define AC_INTFLAGSET_COMP(value)             (AC_INTFLAGSET_COMP_Msk & (_UINT32_(value) << AC_INTFLAGSET_COMP_Pos)) 
#define AC_INTFLAGSET_WIN_Pos                 _UINT32_(4)                                          /* (AC_INTFLAGSET Position) Window x Interrupt Flag */
#define AC_INTFLAGSET_WIN_Msk                 (_UINT32_(0x1) << AC_INTFLAGSET_WIN_Pos)             /* (AC_INTFLAGSET Mask) WIN */
#define AC_INTFLAGSET_WIN(value)              (AC_INTFLAGSET_WIN_Msk & (_UINT32_(value) << AC_INTFLAGSET_WIN_Pos)) 

/* -------- AC_STATUS : (AC Offset: 0x34) ( R/ 32) Status -------- */
#define AC_STATUS_RESETVALUE                  _UINT32_(0x00)                                       /*  (AC_STATUS) Status  Reset Value */

#define AC_STATUS_COMPSTATE0_Pos              _UINT32_(0)                                          /* (AC_STATUS) Comparator 0 State Position */
#define AC_STATUS_COMPSTATE0_Msk              (_UINT32_(0x1) << AC_STATUS_COMPSTATE0_Pos)          /* (AC_STATUS) Comparator 0 State Mask */
#define AC_STATUS_COMPSTATE0(value)           (AC_STATUS_COMPSTATE0_Msk & (_UINT32_(value) << AC_STATUS_COMPSTATE0_Pos)) /* Assignment of value for COMPSTATE0 in the AC_STATUS register */
#define AC_STATUS_COMPSTATE1_Pos              _UINT32_(1)                                          /* (AC_STATUS) Comparator 1 State Position */
#define AC_STATUS_COMPSTATE1_Msk              (_UINT32_(0x1) << AC_STATUS_COMPSTATE1_Pos)          /* (AC_STATUS) Comparator 1 State Mask */
#define AC_STATUS_COMPSTATE1(value)           (AC_STATUS_COMPSTATE1_Msk & (_UINT32_(value) << AC_STATUS_COMPSTATE1_Pos)) /* Assignment of value for COMPSTATE1 in the AC_STATUS register */
#define AC_STATUS_WINSTATE0_Pos               _UINT32_(4)                                          /* (AC_STATUS) Window 0 State Position */
#define AC_STATUS_WINSTATE0_Msk               (_UINT32_(0x3) << AC_STATUS_WINSTATE0_Pos)           /* (AC_STATUS) Window 0 State Mask */
#define AC_STATUS_WINSTATE0(value)            (AC_STATUS_WINSTATE0_Msk & (_UINT32_(value) << AC_STATUS_WINSTATE0_Pos)) /* Assignment of value for WINSTATE0 in the AC_STATUS register */
#define   AC_STATUS_WINSTATE0_ABOVE_Val       _UINT32_(0x0)                                        /* (AC_STATUS) The input signal is above window n  */
#define   AC_STATUS_WINSTATE0_INSIDE_Val      _UINT32_(0x1)                                        /* (AC_STATUS) The input signal is inside window n  */
#define   AC_STATUS_WINSTATE0_BELOW_Val       _UINT32_(0x2)                                        /* (AC_STATUS) The input signal is below window n  */
#define AC_STATUS_WINSTATE0_ABOVE             (AC_STATUS_WINSTATE0_ABOVE_Val << AC_STATUS_WINSTATE0_Pos) /* (AC_STATUS) The input signal is above window n Position */
#define AC_STATUS_WINSTATE0_INSIDE            (AC_STATUS_WINSTATE0_INSIDE_Val << AC_STATUS_WINSTATE0_Pos) /* (AC_STATUS) The input signal is inside window n Position */
#define AC_STATUS_WINSTATE0_BELOW             (AC_STATUS_WINSTATE0_BELOW_Val << AC_STATUS_WINSTATE0_Pos) /* (AC_STATUS) The input signal is below window n Position */
#define AC_STATUS_Msk                         _UINT32_(0x00000033)                                 /* (AC_STATUS) Register Mask  */

#define AC_STATUS_COMPSTATE_Pos               _UINT32_(0)                                          /* (AC_STATUS Position) Comparator x State */
#define AC_STATUS_COMPSTATE_Msk               (_UINT32_(0x3) << AC_STATUS_COMPSTATE_Pos)           /* (AC_STATUS Mask) COMPSTATE */
#define AC_STATUS_COMPSTATE(value)            (AC_STATUS_COMPSTATE_Msk & (_UINT32_(value) << AC_STATUS_COMPSTATE_Pos)) 

/* -------- AC_WPCTRL : (AC Offset: 0x80) (R/W 32) Write Protection Control -------- */
#define AC_WPCTRL_RESETVALUE                  _UINT32_(0x00)                                       /*  (AC_WPCTRL) Write Protection Control  Reset Value */

