Microchip-MPLAB-Harmony/touch_apps/apps/t10_mutualcap_xpro_board/pic32cm_pl10_cnano/firmware/src/packs/PIC32CM6408PL10048_DFP/component/ac.h
#define AC_WPCTRL_WPEN_Pos                    _UINT32_(0)                                          /* (AC_WPCTRL) Write Protection Enable Position */
#define AC_WPCTRL_WPEN_Msk                    (_UINT32_(0x1) << AC_WPCTRL_WPEN_Pos)                /* (AC_WPCTRL) Write Protection Enable Mask */
#define AC_WPCTRL_WPEN(value)                 (AC_WPCTRL_WPEN_Msk & (_UINT32_(value) << AC_WPCTRL_WPEN_Pos)) /* Assignment of value for WPEN in the AC_WPCTRL register */
#define AC_WPCTRL_WPLCK_Pos                   _UINT32_(1)                                          /* (AC_WPCTRL) Write Protection Lock Position */
#define AC_WPCTRL_WPLCK_Msk                   (_UINT32_(0x1) << AC_WPCTRL_WPLCK_Pos)               /* (AC_WPCTRL) Write Protection Lock Mask */
#define AC_WPCTRL_WPLCK(value)                (AC_WPCTRL_WPLCK_Msk & (_UINT32_(value) << AC_WPCTRL_WPLCK_Pos)) /* Assignment of value for WPLCK in the AC_WPCTRL register */
#define AC_WPCTRL_WPKEY_Pos                   _UINT32_(8)                                          /* (AC_WPCTRL) Write Protection Key Position */
#define AC_WPCTRL_WPKEY_Msk                   (_UINT32_(0xFFFFFF) << AC_WPCTRL_WPKEY_Pos)          /* (AC_WPCTRL) Write Protection Key Mask */
#define AC_WPCTRL_WPKEY(value)                (AC_WPCTRL_WPKEY_Msk & (_UINT32_(value) << AC_WPCTRL_WPKEY_Pos)) /* Assignment of value for WPKEY in the AC_WPCTRL register */
#define   AC_WPCTRL_WPKEY_KEY_Val             _UINT32_(0x414320)                                   /* (AC_WPCTRL) Allow writes to the WPCTRL register  */
#define AC_WPCTRL_WPKEY_KEY                   (AC_WPCTRL_WPKEY_KEY_Val << AC_WPCTRL_WPKEY_Pos)     /* (AC_WPCTRL) Allow writes to the WPCTRL register Position */
#define AC_WPCTRL_Msk                         _UINT32_(0xFFFFFF03)                                 /* (AC_WPCTRL) Register Mask  */


/* AC register offsets definitions */
#define AC_COMPCTRLA_REG_OFST          _UINT32_(0x00)      /* (AC_COMPCTRLA) Comparator # Comparator Control A Offset */
#define AC_COMPCTRLB_REG_OFST          _UINT32_(0x04)      /* (AC_COMPCTRLB) Comparator # Comparator Control B Offset */
#define AC_COMPSCALER_REG_OFST         _UINT32_(0x08)      /* (AC_COMPSCALER) Comparator # Comparator Scaler Offset */
#define AC_CTRLA_REG_OFST              _UINT32_(0x00)      /* (AC_CTRLA) Control A Offset */
#define AC_CTRLB_REG_OFST              _UINT32_(0x04)      /* (AC_CTRLB) Control B Offset */
#define AC_WINCTRL_REG_OFST            _UINT32_(0x14)      /* (AC_WINCTRL) Window Control Offset */
#define AC_EVCTRL_REG_OFST             _UINT32_(0x20)      /* (AC_EVCTRL) Event Control Offset */
#define AC_INTENCLR_REG_OFST           _UINT32_(0x24)      /* (AC_INTENCLR) Interrupt Enable Clear Offset */
#define AC_INTENSET_REG_OFST           _UINT32_(0x28)      /* (AC_INTENSET) Interrupt Enable Set Offset */
#define AC_INTFLAG_REG_OFST            _UINT32_(0x2C)      /* (AC_INTFLAG) Interrupt Flag Status and Clear Offset */
#define AC_INTFLAGSET_REG_OFST         _UINT32_(0x30)      /* (AC_INTFLAGSET) Interrupt Flag Set Offset */
#define AC_STATUS_REG_OFST             _UINT32_(0x34)      /* (AC_STATUS) Status Offset */
#define AC_WPCTRL_REG_OFST             _UINT32_(0x80)      /* (AC_WPCTRL) Write Protection Control Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* COMP register API structure */
typedef struct
{
  __IO  uint32_t                       AC_COMPCTRLA;       /* Offset: 0x00 (R/W  32) Comparator # Comparator Control A */
  __IO  uint32_t                       AC_COMPCTRLB;       /* Offset: 0x04 (R/W  32) Comparator # Comparator Control B */
  __IO  uint32_t                       AC_COMPSCALER;      /* Offset: 0x08 (R/W  32) Comparator # Comparator Scaler */
  __I   uint8_t                        Reserved1[0x04];
} ac_comp_registers_t;

#define AC_COMP_NUMBER 2

/* AC register API structure */
typedef struct
{  /* Analog Comparator */
  __IO  uint32_t                       AC_CTRLA;           /* Offset: 0x00 (R/W  32) Control A */
  __IO  uint32_t                       AC_CTRLB;           /* Offset: 0x04 (R/W  32) Control B */
  __I   uint8_t                        Reserved1[0x0C];
  __IO  uint32_t                       AC_WINCTRL;         /* Offset: 0x14 (R/W  32) Window Control */
  __I   uint8_t                        Reserved2[0x08];
  __IO  uint32_t                       AC_EVCTRL;          /* Offset: 0x20 (R/W  32) Event Control */
  __IO  uint32_t                       AC_INTENCLR;        /* Offset: 0x24 (R/W  32) Interrupt Enable Clear */
  __IO  uint32_t                       AC_INTENSET;        /* Offset: 0x28 (R/W  32) Interrupt Enable Set */
  __IO  uint32_t                       AC_INTFLAG;         /* Offset: 0x2C (R/W  32) Interrupt Flag Status and Clear */
  __IO  uint32_t                       AC_INTFLAGSET;      /* Offset: 0x30 (R/W  32) Interrupt Flag Set */
  __I   uint32_t                       AC_STATUS;          /* Offset: 0x34 (R/   32) Status */
  __I   uint8_t                        Reserved3[0x08];
        ac_comp_registers_t            COMP[AC_COMP_NUMBER]; /* Offset: 0x40  */
  __I   uint8_t                        Reserved4[0x20];
  __IO  uint32_t                       AC_WPCTRL;          /* Offset: 0x80 (R/W  32) Write Protection Control */
} ac_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CMPL10_AC_COMPONENT_H_ */
